<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"695d6e304d017bd91d0d5db07e7ac29a608d84bb3be7d3b710f81bb3b3af27c6","plan_job_ref":"Job Test OpenTofu early eval #28 at https://github.com/dflook/terraform-github-actions/actions/runs/15311002250","plan_out_hash":"0f8b76585fbbba03dd8ff9a6cd3da7f411ed28ae321494e9a75b1a76d49f3d25","plan_hash":"10320d34e420c4d85d5e5ad9768d6e4d0674f530e7bc053b05ef7ef072f975a5","plan_text_format":"diff","version":"99.0.0"} -->
OpenTofu plan in __tests/workflows/test-early-eval/s3__
With variables: `passphrase = (sensitive value)`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.s3-bucket.aws_s3_bucket.this[0] will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = false
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.s3-bucket.aws_s3_bucket_public_access_block.this[0] will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test OpenTofu early eval #28](https://github.com/dflook/terraform-github-actions/actions/runs/15311002250)